satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
/*****************  end public debug methods *************************/


/*********************************************/
/**  Printable interface, printTo()          */
/*********************************************/
// this interface allows you to print to a SafeString
// e.g.
//  sfStr.print(55,HEX);
//
size_t SafeString::printTo(Print& p) const {
  SafeString *ptr = (SafeString *)(this); // do this to get around the required const designator
  ptr->cleanUp();
  return p.print(buffer);
}
/***************** end of implementation of Printable interface *************************/

/*************************************************/
/**  Print support, write(), print..() methods   */
/*************************************************/
size_t SafeString::write(uint8_t b) {
  cleanUp();
  if (b == 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("write"));
      debugPtr->print(F(" of 0"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  size_t newlen = len + 1;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("write"), newlen, NULL, NULL);
#endif // SSTRING_DEBUG
    return 0;
  }
  concat((char)b);
  return 1;
}

// write at most length chars from buffer into this SafeString
// NOTE: write(cstr,length) will set hasError and optionally output errorMsg, if strlen(cstr) < length and nothing will be added to the SafeString
size_t SafeString::write(const uint8_t *buffer, size_t length) {
  cleanUp();
  if (length == 0) {
    return 0;
  }
  // concat check length so normalize it here
  //  size_t bufferLen = limitedStrLen((char *)buffer, length);
  //  if (bufferLen < length) {
  //      length = bufferLen;
  //  }
  size_t initialLen = len;
  size_t newlen = len + length;

  if (length > limitedStrLen((char *)buffer, length)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("write"));
      debugPtr->print(F(" length ")); debugPtr->print(length); debugPtr->print(F(" > uint8_t* arg strlen."));
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was "));
        debugPtr->print(F(" { "));
        for (size_t i = 0; i < length; i++) {
          debugPtr->print(buffer[i]); debugPtr->print(i < (length - 1) ? ',' : ' ');
        }
        debugPtr->print(F("} "));
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }

  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("write"), newlen, (const char*)buffer, NULL, '\0', length);
#endif // SSTRING_DEBUG
    return 0;
  }
  concat((const char*)buffer, length);
  return len - initialLen;
}

size_t SafeString::println() {
  cleanUp();
  size_t newlen = len + 2;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("println"), newlen, NULL, NULL);
#endif // SSTRING_DEBUG
    return 0;
  }
  Print::println();
  return 2;
}

SafeString & SafeString::newline() {
  println(); // calls cleanUp()
  return *this;
}

// used by println
SafeString & SafeString::concatln(char c) {
  cleanUp();
  if (c == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      printlnErr();
      debugPtr->print(F(" of '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return *this;
  }
  size_t newlen = len + 1 + 2;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("println"), newlen, NULL, NULL, c);
#endif // SSTRING_DEBUG
    return *this;
  }
  concat(c);
  Print::println();
  return *this;
}

SafeString & SafeString::concatln(const __FlashStringHelper * pstr) {
  cleanUp();
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      printlnErr();
      debugPtr->print(F(" was passed a NULL F( ) pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return *this;
  }
  size_t pLen = strlen_P((PGM_P)pstr);
  size_t newlen = len + pLen + 2;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("println"), newlen, NULL, pstr);
#endif // SSTRING_DEBUG
    return *this;
  }
  concat(pstr, strlen_P((PGM_P)pstr));
  Print::println();
  return *this;
}

SafeString & SafeString::concatln(const char *cstr, size_t length) {
  cleanUp();
  size_t newlen = len + length + 2;
  if (!cstr)  {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      printlnErr();
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return *this;
  }

  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("println"), newlen, cstr, NULL, '\0', length);
#endif // SSTRING_DEBUG
    return *this;
  }
  concat(cstr, length);
  Print::println();
  return *this;
}



//============= public print methods ===========
size_t SafeString::print(unsigned char c, int d) {        
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal((unsigned long)c, d); // calls cleanUp()
}
size_t SafeString::print(int i, int d) {        
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal((long)i, d); // calls cleanUp()
}
size_t SafeString::print(unsigned int u, int d) { 
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal((unsigned long)u, d); // calls cleanUp()
}
size_t SafeString::print(long l, int d) {
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal(l, d); // calls cleanUp()
}
size_t SafeString::print(unsigned long l, int d) {     
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal(l, d); // calls cleanUp()
}
size_t SafeString::print(int64_t l, int d) {        
  if ((d < 2) || (d > 16)) {
      baseError(F("print"),d);
      return 0;
  }
  return printInternal(l, d); // calls cleanUp()
}
size_t SafeString::print(double d, int decs) {
  return printInternal(d, decs); // calls cleanUp()
}

/**
  print to SafeString a double (or long) with decs after the decimal point
  and padd to specified width (+ve width padds on left, -ve width padds on right);
  width is signed value, negative for left adjustment, +ve for right padding
  by default the + sign is not added, set forceSign argument to true to force the display of the + sign

  If the result exceed abs(width), reduce the decs after the decmial point to fit
  If result with decs == 0 still > abs(width) raise an error and ,optionally, output an error msg

  Note decs is quietly limited in this method to < 7
*/
size_t SafeString::print(double d, int decs, int width, bool forceSign) {
  return printInt(d, decs, width, forceSign, false);
}
size_t SafeString::println(double d, int decs, int width, bool forceSign) {
  return printInt(d, decs, width, forceSign, true);
}

