satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
// internal print method called by other print methods
size_t SafeString::printInt(double d, int decs, int width, bool forceSign, bool addNL) {
  // if addNL need to allow 2 for nl in SafeString, width does not change
  size_t nlExtra = addNL ? 2 : 0;

  size_t absWidth = 0;
  if (width < 0) {
    absWidth = (-width);
  } else {
    absWidth = width;
  }
  // need to force a + sign
  if (forceSign) {
    if (d < 0) { // nothing to do
      forceSign = false;
    } else {
      d = -d; // this will add a - which will be replaced with + at the end
    }
  }

  if ((absWidth == 0) || ((absWidth == 1) && (forceSign))) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (addNL) {
        errorMethod(F("println"));
      } else {
        errorMethod(F("print"));
      }
      debugPtr->print(F(" width:")); debugPtr->print(width); debugPtr->print(F(" too small to display even just the integer part of "));  debugPtr->print(d);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }

  if (decs < 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (addNL) {
        errorMethod(F("println"));
      } else {
        errorMethod(F("print"));
      }
      debugPtr->print(F(" number places after the decimal point, ")); debugPtr->print(decs); debugPtr->print(F(" < 0"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  if ((absWidth + nlExtra) > (_capacity - len)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (addNL) {
        errorMethod(F("println"));
      } else {
        errorMethod(F("print"));
      }
      debugPtr->print(F(" needs capacity of ")); debugPtr->print(len + absWidth + nlExtra);  debugPtr->print(F(" too add number formatted to fixed width:")); debugPtr->print(width);
      if (addNL) {
        debugPtr->print(F(" and newline"));
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  // max chars are 11 for integer part including sign (-4294967040), + 1 (.) + 7 prec (prec limited to 7) = 19 + '\0' => 20
  // ESP32
  // max chars are 19 for integer part including sign (-9223372036854775807L), + 1 (.) + 7 prec (prec limited to 7) = 19 +1 + 7 + '\0' => 27
  char result[33]; // 19 +1 + 7 + '\0' => 27 for extra
  result[0] = '\0';
  if (isnan(d)) {
    strcpy(result, "nan");
  } else if (isinf(d)) {
    strcpy(result, "inf");
  } else if (d >= 4294967039.0) {
    strcpy(result, "ovf"); // constant determined empirically
  } else if (d <= -4294967039.0) {
    strcpy(result, "-ovf"); // constant determined empirically
  } else {
    if (decs > 7) {
      decs = 7; // seems to be the limit for print
    }
    dtostrf(d, width, decs, result);
    while ((strlen(result) > absWidth) && (decs > 0)) {
      // try reducing precision
      decs--;
      dtostrf(d, width, decs, result);
    }
  }
  size_t resultLen = strlen(result);
  if ((resultLen) > absWidth) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (addNL) {
        errorMethod(F("println"));
      } else {
        errorMethod(F("print"));
      }
      debugPtr->print(F(" width:")); debugPtr->print(width); debugPtr->print(F(" too small to display even just the integer part of "));  debugPtr->print(d);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    // return 0;
    result[0] = '\0'; // clear result and just padd below
  }
  // else may need to padd nan etc
  cSFA(sfResult, result);
  while (sfResult.length() < absWidth) {
    if (width < 0) {
      sfResult.prefix(' ');
    } else {
      sfResult.concat(' ');
    }
  }
  if (forceSign) { // replace - with +
    sfResult.replace('-', '+');
    // note 0.0 does not have + so handle that here
    if (sfResult.indexOf('+') < 0) {
      // still need to add +
      // find first digit
      int idx = sfResult.indexOfCharFrom("0123456789.");
      if (idx > 0) {
        sfResult.setCharAt(idx - 1, '+');
      } else {            // should not happen
        setError();
#ifdef SSTRING_DEBUG
        if (debugPtr) {
          if (addNL) {
            errorMethod(F("println"));
          } else {
            errorMethod(F("print"));
          }
          debugPtr->print(F(" Internal Error: no space to add + sign with width:")); debugPtr->print(width); debugPtr->print(F(" d:"));  debugPtr->print(d);
          debugInternalMsg(fullDebug);
        }
#endif // SSTRING_DEBUG          
      }
    }
  }

  // already padded just concat
  if (nlExtra == 0) {
    concat(result);
    return resultLen;
  } else {
    concatln(result, resultLen);
    return (resultLen + 2);
  }
}

size_t SafeString::print(SafeString &str) {
  str.cleanUp();
  cleanUp();
  size_t addLen = str.len;
  size_t newlen = len + addLen;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("print"), newlen, str.buffer, NULL);
#endif // SSTRING_DEBUG
    return 0;
  }
  concat(str);
  return addLen;
}

size_t SafeString::print(const char* cstr) {
  cleanUp();
  if (!cstr)  {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("print"));
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  size_t str_len = strlen(cstr);
  size_t newlen = len + str_len;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("print"), newlen, cstr, NULL);
#endif // SSTRING_DEBUG
    return 0;
  }
  concat(cstr, str_len);
  return str_len;
}

size_t SafeString::print(char c) {
  cleanUp();
  if (c == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("print"));
      debugPtr->print(F(" of '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }

  size_t newlen = len + 1;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("print"), newlen, NULL, NULL, c);
#endif // SSTRING_DEBUG
    return 0;
  }
  concat(c);
  return 1;
}

size_t SafeString::print(const __FlashStringHelper *pstr) {
  cleanUp();
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("print"));
      debugPtr->print(F(" was passed a NULL F( ) pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  size_t newlen = len + strlen_P((PGM_P)pstr);
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      capError(F("print"), newlen, NULL, pstr);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  concat(pstr);
  return (strlen_P((PGM_P)pstr));
}

// =========================================

// ============ protected internal print methods =============


size_t SafeString::printInternal(int64_t num, int base, bool assignOp) {
  cleanUp();
  const size_t bufLen = 8 * sizeof(int64_t) + 4;
  char reverseTempBuffer[bufLen];
  char tempBuffer[bufLen];
  size_t tempLen = 0;
  // from sprintf
   do {
    const char digit = (char)(num % base);
    reverseTempBuffer[tempLen++] = (digit < 10) ? ('0' + digit) : ('A' + digit - 10);
    num /= base;
  } while(num);
  reverseTempBuffer[tempLen] = '\0';
  size_t i = 0;
  for (int j = tempLen-1; j>=0; j--) {
      tempBuffer[i] = reverseTempBuffer[j];
    i++;
  }
  tempBuffer[i] = '\0';
  
