satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
  size_t newlen = len + tempLen;
  if (assignOp) {
    newlen = tempLen;
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, tempBuffer, NULL, '\0', true);
    } else {
      capError(F("print"), newlen, tempBuffer, NULL);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  if (assignOp) {
    clear(); // clear first
  }
  concat(tempBuffer);
  return tempLen;
}

size_t SafeString::printInternal(long num, int base, bool assignOp) {
  cleanUp();
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  size_t newlen = len + temp.length();
  if (assignOp) {
    newlen = temp.length();
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, temp.buffer, NULL, '\0', true);
    } else {
      capError(F("print"), newlen, temp.buffer, NULL);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  if (assignOp) {
    clear(); // clear first
  }
  concat(temp);
  return n;
}

size_t SafeString::printInternal(unsigned long num, int base, bool assignOp) {
  cleanUp();
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  size_t newlen = len + temp.length();
  if (assignOp) {
    newlen = temp.length();
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, temp.buffer, NULL,  '\0', true);
    } else {
      capError(F("print"), newlen, temp.buffer, NULL);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  if (assignOp) {
    clear(); // clear first
  }
  concat(temp);
  return n;
}

size_t SafeString::printInternal(double num, int digits, bool assignOp) {
  cleanUp();
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  if (digits > 7) {
    digits = 7; // seems to be the limit for print
  }
  size_t n = temp.Print::print(num, digits);
  size_t newlen = len + temp.length();
  if (assignOp) {
    newlen = temp.length();
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, temp.buffer, NULL,  '\0', true);
    } else {
      capError(F("print"), newlen, temp.buffer, NULL);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  if (assignOp) {
    clear(); // clear first
  }
  concat(temp);
  return n;
}

// =========================================================================

// ============ println =========================================

size_t SafeString::println(SafeString &str) {
  str.cleanUp();
  cleanUp();
  size_t newlen = len + str.len + 2;
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    capError(F("println"), newlen, str.buffer);
#endif // SSTRING_DEBUG
    return 0;
  }
  size_t addLen = str.len + 2;
  concat(str);
  Print::println();
  return addLen;
}

size_t SafeString::println(const __FlashStringHelper *pstr) {
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("println"));
      debugPtr->print(F(" was passed a NULL F( ) pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  concatln(pstr); // calls cleanUp()
  return (strlen_P((PGM_P)pstr) + 2);
}

size_t SafeString::println(const char* cstr) {
  if (!cstr)  {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      printlnErr();
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return 0;
  }
  size_t length = strlen(cstr);
  concatln(cstr, length);
  return length + 2;
}

size_t SafeString::println(char c) {
  concatln(c); // calls cleanUp()
  return 3;
}

size_t SafeString::println(unsigned char b, int base) {
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(b, base);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(int num, int base) {
    
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(unsigned int num, int base) {
    
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(long num, int base) {
    
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(unsigned long num, int base) {
    
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  size_t n = temp.Print::print(num, base);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(int64_t num, int base) {
    
  if ((base < 2) || (base > 16)) {
      baseError(F("println"),base);
      return 0;
  }
  size_t n = printInternal(num, base);  // calls cleanUp()
  concat("\r\n"); // calls cleanUp()
  return n + 2;
}

size_t SafeString::println(double num, int digits) {
  createSafeString(temp, 8 * sizeof(long) + 4); // null + sign + nl
  if (digits > 18) {
    digits = 18;
  }
  size_t n = temp.Print::print(num, digits);
  concatln(temp.buffer, temp.len); // calls cleanUp()
  return n + 2;
}

/*** end of write() and print..() methods for Print support ***********/


/*********************************************/
/* No Memory Management methods              */
/*********************************************/
// just checks there is enough spare space
unsigned char SafeString::reserve(unsigned int size) {
  if (_capacity >= size) { // buffer never NULL
    return true;
  }
  return false; // error
}
/**** end of memory mamagement methods *****/

/*************************************************/
/**  assignment operator methods                 */
/*************************************************/
SafeString & SafeString::operator = (SafeString &rhs) {
  rhs.cleanUp();
  cleanUp();
  if (buffer == rhs.buffer) { // allow for same buffer in different SafeStrings
    return *this;
  }
  return concatInternal(rhs.buffer, true);
}

