satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
SafeString & SafeString::concat(const char *cstr, size_t length) {
  return concatInternal(cstr, length, false); // calls cleanUp()
}

// you can concat to yourself if there is enough room, i.e. str.concat(str);
SafeString & SafeString::concat(SafeString &s) {
  s.cleanUp();
  return concat(s.buffer, s.len);
}


SafeString & SafeString::concat(unsigned char num) {
  createSafeString(temp, 2 + 3 * sizeof(unsigned char));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(int num) {
  createSafeString(temp, 2 + 3 * sizeof(int));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(unsigned int num) {
  createSafeString(temp, 2 + 3 * sizeof(unsigned int));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(long num) {
  createSafeString(temp, 2 + 3 * sizeof(long));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(unsigned long num) {
  createSafeString(temp, 2 + 3 * sizeof(unsigned long));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(int64_t num) {
  createSafeString(temp, 2 + 3 * sizeof(int64_t));
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(float num) {
  createSafeString(temp, 22);
  temp.print(num);
  return concat(temp); // calls cleanUp()
}

SafeString & SafeString::concat(double num) {
  createSafeString(temp, 22);
  temp.print(num);
  return concat(temp); // calls cleanUp()
}
SafeString & SafeString::concat(const __FlashStringHelper * pstr) {
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("concat"));
      debugPtr->print(F(" was passed a NULL F( ) pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return *this;
  }
  return concatInternal(pstr);
}

// concat at most length chars
SafeString & SafeString::concat(const __FlashStringHelper * pstr, size_t length) {
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("concat"));
      debugPtr->print(F(" was passed a NULL F( ) pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return *this;
  }
  return concatInternal(pstr, length, false);
}

// ============== internal concat methods
// concat at most length chars from cstr
// this method applies assignOp
SafeString & SafeString::concatInternal(const char *cstr, size_t length, bool assignOp) {

  cleanUp();
  size_t newlen = len + length;
  if (assignOp) {
    newlen = length;
  }
  if (!cstr)  {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (assignOp) {
        assignErrorMethod();
      }  else {
        concatErr();
      }
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (length == 0) {
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (length > limitedStrLen(cstr, length)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (assignOp) {
        assignErrorMethod();
      }  else {
        concatErr();
      }
      debugPtr->print(F(" length ")); debugPtr->print(length); debugPtr->print(F(" > char* arg strlen."));
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was '")); debugPtr->print(cstr); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, cstr, NULL);
    }  else {
      capError(F("concat"), newlen, cstr, NULL, '\0', length);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (assignOp) {
    clear();
  }
  memmove(buffer + len, cstr, length);
  len = newlen;
  buffer[len] = '\0';
  return *this;
}

// concat at most length chars
// this method applies assignOp
SafeString & SafeString::concatInternal(const __FlashStringHelper * pstr, size_t length, bool assignOp) {
  cleanUp();
  if (!pstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (assignOp) {
        assignErrorMethod();
      }  else {
        concatErr();
      }
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (length == 0) {
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (length > strlen_P((PGM_P)pstr)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (assignOp) {
        assignErrorMethod();
      }  else {
        concatErr();
      }
      debugPtr->print(F(" length ")); debugPtr->print(length); debugPtr->print(F(" > F() arg strlen."));
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was '")); debugPtr->print(pstr); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }

  size_t newlen = len + length;
  if (assignOp) {
    newlen = length;
  }
  if (!reserve(newlen)) {
    setError();
#ifdef SSTRING_DEBUG
    if (assignOp) {
      assignError(newlen, NULL, pstr);
    }  else {
      capError(F("concat"), newlen, NULL, pstr, '\0', length);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if (assignOp) {
    clear();
  }
  memcpy_P(buffer + len, (PGM_P)pstr, length);
  len = newlen;
  buffer[len] = '\0';
  return *this;
}

SafeString & SafeString::concatInternal(char c, bool assignOp) {
  cleanUp();
  if (c == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      if (assignOp) {
        concatAssignError();
      } else {
        concatErr();
      }
      debugPtr->print(F(" of '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    if (assignOp) {
      clear();
    }
    return *this;
  }
  if ((assignOp) && (_capacity < 1)) { // && (c != '\0')) {
    setError();
#ifdef SSTRING_DEBUG
    assignError(1, NULL, NULL, c);
#endif
    if (assignOp) {
      clear();
    }
    return *this;
  }
  char buf[2];
  buf[0] = c;
  buf[1] = 0;
  return concatInternal(buf, strlen(buf), assignOp);
}


SafeString & SafeString::concatInternal(const char *cstr, bool assignOp) {
  cleanUp();

