satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
int SafeString::lastIndexOf( char theChar ) {
  return lastIndexOf(theChar, len - 1); // calls cleanUp() // if len == 0, len-1 == (unsigned int)-1
}

int SafeString::lastIndexOf(char ch, unsigned int fromIndex) {
  cleanUp();
  if (ch == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" char arg was '\\0'"));
      outputFromIndexIfFullDebug(fromIndex);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    //return -1; // probabily an error
  }
  if (len == 0) {
    return -1;
  }

  if ((fromIndex == (unsigned int)(-1)) || (fromIndex == len)) {
    return -1;
  }
  if (fromIndex > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" fromIndex ")); debugPtr->print(fromIndex); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was '")); debugPtr->print(ch); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  char tempchar = buffer[fromIndex + 1];
  buffer[fromIndex + 1] = '\0';
  char* temp = strrchr( buffer, ch );
  buffer[fromIndex + 1] = tempchar;
  if (temp == NULL) {
    return -1;
  }
  return temp - buffer;
}


int SafeString::lastIndexOf(SafeString &s2) {
  s2.cleanUp();
  cleanUp();
  //  if (len < s2.len) {
  //    return -1;
  //  } // else len - s2.len is valid
  return lastIndexOf(s2, len - s2.len);
}


int SafeString::lastIndexOf( const char *cstr ) {
  if (!cstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" was passed a NULL pointer"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  size_t cstrlen = strlen(cstr);
  //  if (len < cstrlen) {
  //    return -1;
  //  } // else len - strlen(cstr) is valid
  return lastIndexOf(cstr, len - cstrlen);
}


int SafeString::lastIndexOf(SafeString &s2, unsigned int fromIndex) {
  s2.cleanUp();
  cleanUp();
  if (s2.len == 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" was passed an empty SafeString ")); s2.outputName();
      outputFromIndexIfFullDebug(fromIndex);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  if (len == 0) {
    return -1;
  }
  //    if (s2.len == 0 || len == 0 || s2.len > len) return -1;
  //  if (s2.len > len) { // check below
  //      return -1;
  //  }
  if (fromIndex == (unsigned int)(-1)) {
    fromIndex = len;
  }
  if (fromIndex > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" fromIndex ")); debugPtr->print(fromIndex); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was '")); debugPtr->print(s2.buffer); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    //    return -1;
  }
  if (fromIndex >= len) fromIndex = len - 1; // len == 0 handled above
  if (s2.len > len) {
    return -1;
  }
  const char* cstr = s2.buffer;
  int found = -1;
  for (char *p = buffer; p <= buffer + fromIndex; p++) {
    p = strstr(p, cstr);
    if (!p) { // not found
      break;
    } // else
    if ((unsigned int)(p - buffer) <= fromIndex) {
      found = p - buffer;
    }
  }
  return found;
}

int SafeString::lastIndexOf(const char* cstr, unsigned int fromIndex) {
  cleanUp();
  if (!cstr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" was passed a NULL pointer"));
      outputFromIndexIfFullDebug(fromIndex);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }

  size_t cstrlen = strlen(cstr);
  if (cstrlen == 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" was passed an empty char array"));
      outputFromIndexIfFullDebug(fromIndex);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  if (len == 0) {
    return -1;
  }
  //    if (s2.len == 0 || len == 0 || s2.len > len) return -1;
  //  if (cstrlen> len) { // check below
  //      return -1;
  //  }
  if (fromIndex == (unsigned int)(-1)) {
    fromIndex = len;
  }

  if (fromIndex > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("lastIndexOf"));
      debugPtr->print(F(" fromIndex ")); debugPtr->print(fromIndex); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Input arg was '")); debugPtr->print(cstr); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }

  if (fromIndex >= len) fromIndex = len - 1; // len == 0 handled above
  if (cstrlen > len) {
    return -1;
  }

  int found = -1;
  for (char *p = buffer; p <= buffer + fromIndex; p++) {
    p = strstr(p, cstr);
    if (!p) { // not found
      break;
    } // else
    if ((unsigned int)(p - buffer) <= fromIndex) {
      found = p - buffer;
    }
  }
  return found;
}

/*
  find first index of one of the chars in the arg

  int SafeString::indexOfCharFrom(SafeString &str) {
  str.cleanUp();
  return indexOfCharFrom(str.buffer, 0); // calls cleanUp()
  }
**/

