satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
  unsigned int idx = startIdx+1;
  int count = 0;
  // start at endIdx and work back looking for start of utf8
  while((idx < len) && (count < maxCount)) { 
    // check idx
    p = charAt(idx);
    // common case ASCII
    if (p <= 0x7F) { // finished check valid utf8
      return idx; // first utf8 start byte found and it is a complete code point 
      // so splitting here will not split a code point
    } 
    // expect trailing bytes with values < 0xC0, 192
    if (p >= 0xC0) { // possible first byte of utf8 code point
      return idx; // so splitting here will not split a code point
    } 
    // else not a utf8 starting byte for a utf8 code point
    // tailing bytes are 
    // in the range >= 0b10000000 (0x80) < 0b11000000 (0xC0)
    // continue
    count++;
    if (count == maxCount) {
      return idx; // have scanned 4 bytes with no start found so split here
      // will not break a valid utf8 code point
    }    
    idx++; // try next one
  }
  return idx; // stopped at end of safeString or after testing 4 bytes 
  // so splitting here will not split a valid utf8 code point
}  

/****  end of uft8 methods  *******************************/
    
/*************************************************/
/**  substring methods                           */
/*************************************************/
// substring is from beginIdx to end of string
// The result substring is ALWAYS cleared by this method
// if beginIdx = length(), an empty result will be returned with out error
// if beginIdx > length(), an empty result will be returned with error flag set on both this SafeString and the result SafeString
// beginIdx == (unsigned int)(-1) returns an empty result without an error
// can take substring of yourself  e.g. str.substring(str,3);
// if result does not have the capacity to hold the substring, hasError() is set on both this SafeString and the result SafeString
SafeString & SafeString::substring(SafeString &result, unsigned int beginIdx) {
  result.cleanUp();
  cleanUp();
  if ( (beginIdx == (unsigned int)(-1)) || ((len == 0) && (beginIdx == 0)) ) {
    result.clear();
    return result;
  }

  if (beginIdx > len) { //== len is OK
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("substring"));
      debugPtr->print(F(" beginIdx ")); debugPtr->print(beginIdx); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    result.clear();
    return result; // no change
  }
  // else  (len > 0) {
  return substring(result, beginIdx, len);
}


// The result substring is ALWAYS cleared by this method
// if beginIdx >= length(), an empty result will be returned
// beginIdx and endIdx will be swapped so that beginIdx <= endIdx and the error flag is set on both this SafeString and the result SafeString
// if endIdx > length(), endIdx is set to length(); and the error flag is set on both this SafeString and the result SafeString
// endIdx == (unsigned int)(-1) is treated as endIdx == length() returns a result without an error
// substring is from beginIdx to endIdx-1, endIdx is exclusive
// can take substring of yourself  e.g. str.substring(str,3,6);
// if result does not have the capacity to hold the substring, and empty result is returned and hasError() is set on both this SafeString and the result SafeString
SafeString & SafeString::substring(SafeString &result, unsigned int beginIdx, unsigned int endIdx) {
  result.cleanUp();
  cleanUp();
  if ((len == 0) && (beginIdx == 0) && (endIdx == 0)) {
    result.clear();
    return result;
  }

  if (beginIdx == (unsigned int)(-1)) {
    beginIdx = len;
  }
  if (endIdx == (unsigned int)(-1)) {
    endIdx = len;
  }

  if (beginIdx > endIdx) {
    unsigned int temp = endIdx;
    endIdx = beginIdx;
    beginIdx = temp;
    setError();
    result.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      warningMethod(F("substring"));
      debugPtr->print(F(" SafeString")); outputName(); debugPtr->print(F(" beginIdx > endIdx "));
      debugInternalResultMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
  }
  // continue

  if (endIdx > len) {
    setError();
    result.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      warningMethod(F("substring"));
      debugPtr->print(F(" SafeString")); outputName(); debugPtr->print(F(" endIdx > length() "));
      debugInternalResultMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    endIdx = len;
    if (beginIdx > len) {
      beginIdx = len;
    }
  }

  // here beginIdx <= endIdx AND endidx <= len
  if ((beginIdx == len) || (beginIdx == endIdx)) {
    result.clear();
    return result; // cleared
  }
  // copy to result
  size_t copyLen = endIdx - beginIdx; // endIdx is exclusive 5,5 copies 0 chars 5,6 copies 1 char char[5].
  if (copyLen > result.capacity()) {
    setError();
    result.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("substring"));
      debugPtr->print(F(" result SafeString")); result.outputName(); debugPtr->print(F(" needs capacity of "));
      debugPtr->print(copyLen);
      result.debugInternalResultMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    result.clear();
    return result; // cleared
  }
  // memmove incase result and SafeString are the same
  memmove(result.buffer, buffer + beginIdx, copyLen);
  result.len = copyLen;
  result.buffer[result.len] = '\0';
  return result;
}
/*****  end of substring methods  *************************/


/*********************************************************/
/**  Modification replace(), remove(), removeLast()      */
/*********************************************************/

/*****  replace(), methods ***********/
// replace single char with another
void SafeString::replace(char f, char r) {
  cleanUp();
  if (len == 0) {
    return;
  }
  if (f == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find char is '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  if (r == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" replace char is '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  for (char *p = buffer; *p; p++) {
    if (*p == f) {
      *p = r;
    }
  }
  return;
}

// replace sequence of chars with another sequence (case sensitive)
void SafeString::replace(const char findChar, SafeString& r) {
  r.cleanUp();
  cleanUp();
  if (findChar == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find char is '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }

  char findChars[] = {findChar, 0};
  replace(findChars, r.buffer);
}

// replace sequence of chars with another sequence (case sensitive)
void SafeString::replace(SafeString& f, SafeString& r) {
  f.cleanUp();
  r.cleanUp();
  cleanUp();
  if (f.len == 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find SafeString")); f.outputName(); debugPtr->print(F(" is empty."));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  replace(f.buffer, r.buffer);
}

