satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
void SafeString::replace(const char findChar, const char *replacePtr) {
  if (findChar == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find char is '\\0'"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  char findChars[] = {findChar, 0};
  replace(findChars, replacePtr);
}

void SafeString::replace(const char* findStr, const char *replacePtr) {
  cleanUp();
  if (!findStr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find arg is NULL"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  if (!replacePtr) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" replace arg is NULL"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }

  size_t findLen = strlen(findStr);
  size_t replaceLen = strlen(replacePtr);
  if (len == 0) {
    return;
  }
  if (replacePtr == buffer) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" replace arg is same SafeString"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  if (findLen == 0) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("replace"));
      debugPtr->print(F(" find ")); debugPtr->print(F(" is empty."));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  /**
    if (findStr == buffer) {
      setError();
    #ifdef SSTRING_DEBUG
      if (debugPtr) {
        errorMethod(F("replace"));
        debugPtr->print(F(" find arg is same SafeString"));
        debugInternalMsg(fullDebug);
      }
    #endif // SSTRING_DEBUG
      return;
    }
  **/
  int diff = replaceLen - findLen;
  char *_readFrom = buffer;
  char *foundAt;
  if (diff == 0) {
    while ((foundAt = strstr(_readFrom, findStr)) != NULL) {
      memmove(foundAt, replacePtr, replaceLen);
      _readFrom = foundAt + replaceLen; // prevents replacing the replace
    }
  } else if (diff < 0) {
    char *writeTo = buffer;
    while ((foundAt = strstr(_readFrom, findStr)) != NULL) {
      size_t n = foundAt - _readFrom;
      memmove(writeTo, _readFrom, n);
      writeTo += n;
      memmove(writeTo, replacePtr, replaceLen);
      writeTo += replaceLen;
      _readFrom = foundAt + findLen; // prevents replacing the replace
      len += diff;
    }
    memmove(writeTo, _readFrom, strlen(_readFrom) + 1);
  } else {
    size_t newlen = len; // compute size needed for result
    while ((foundAt = strstr(_readFrom, findStr)) != NULL) {
      _readFrom = foundAt + findLen;
      newlen += diff;
    }
    if (!reserve(newlen)) {
      setError();
#ifdef SSTRING_DEBUG
      if (debugPtr) {
        capError(F("replace"), newlen, findStr);
        if (fullDebug) {
          debugPtr->print(F("       "));
          debugPtr->print(F(" Replace arg was '")); debugPtr->print(replacePtr); debugPtr->println('\'');
        }
      }
#endif // SSTRING_DEBUG
      return;
    }

    size_t index = len - 1; // len checked for != above
    while ((index = lastIndexOf(findStr, index)) < len) {
      _readFrom = buffer + index + findLen;
      memmove(_readFrom + diff, _readFrom, len - (_readFrom - buffer));
      int newLen = len + diff;
      memmove(buffer + index, replacePtr, replaceLen);
      len = newLen;
      buffer[newLen] = 0;
      if (index == 0) {
        break; // at front of string
      } // else
      index--;
    }
    len = newlen;
    buffer[newlen] = 0;
  }
  return;
}
/***** end of  replace(), methods ***********/


/***** removeFrom(), keepFrom() remove(), remooveLast(), keepLast() methods ***********/
// remove from index to end of SafeString
// 0 to length() and (unsigned int)(-1) are valid for index,
// -1 => length() for processing and just returns without error
void SafeString::removeFrom(unsigned int startIndex) {
  remove(startIndex);
}

// remove from 0 to startIdx (excluding startIdx)
// 0 to length() and (unsigned int)(-1) are valid for index,
void SafeString::removeBefore(unsigned int index) {
  if (index == (unsigned int)(-1)) {
    clear();
    return;
    /**
        setError();
      #ifdef SSTRING_DEBUG
        if (debugPtr) {
          errorMethod(F("removeBefore"));
          debugPtr->print(F(" index ")); debugPtr->print(index); debugPtr->print(F(" == -1 "));
          debugInternalMsg(fullDebug);
        }
      #endif // SSTRING_DEBUG
        return;
    **/
  }
  remove(0, index); // calls cleanUp()
}

// remove from index to end of SafeString
// 0 to length() and (unsigned int)(-1) are valid for index,
// -1 => length() for processing and just returns without error
void SafeString::remove(unsigned int index) {
  if (index == (unsigned int)(-1)) {
    //index = length();
    return;
  }
  if (index > length()) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("remove"));
      debugPtr->print(F(" index ")); debugPtr->print(index); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return;
  }
  // else
  remove(index, length() - index);
}

// remove count chars starting from index
// 0 to length() and (unsigned int)(-1) are valid for index
// -1 just returns without error
// 0 to (length()- index) is valid for count, larger values set the error flag and remove from idx to end of string
void SafeString::remove(unsigned int index, unsigned int count) {
  cleanUp();
  if (index == (unsigned int)(-1)) {
    index = len;
  }

  if (index > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("remove"));
      debugPtr->print(F(" index ")); debugPtr->print(index); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    index = len;
  }

  if (count > (len - index)) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("remove"));
      debugPtr->print(F(" count ")); debugPtr->print(count); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len); debugPtr->print(F(" - index ")); debugPtr->print(index) ;
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    count = len - index;
  }
  if (count == 0) {
    return;
  }
  char *writeTo = buffer + index;
  memmove(writeTo, buffer + index + count, len - index - count + 1);
  len -= count;
  buffer[len] = 0;
}

// remove the last 'count' chars
// 0 to length() is valid for count,
// count >= length() clears the SafeString
// count > length() set the error flag
void SafeString::removeLast(unsigned int count) {
  cleanUp();
  // else
  if (count > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("removeLast"));
      debugPtr->print(F(" count ")); debugPtr->print(count); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
  }
  if (count >= len) {
    // remove all
    clear();
    return;
  }
  // else
  remove(len - count, count);
}

