satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
/**  possible alternative
  // convert float number, returns 0.0 and sets error flag not a valid number
  float SafeString::toFloat() {
  cleanUp();
  double d;
  if (toDouble(d)) {
    return (float)d; // need to ckeck size here
  } // else
  setError();
  #ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("toFloat()"));
      debugPtr->print(F(" invalid float "));
      debugInternalMsg(fullDebug);
    }
  #endif // SSTRING_DEBUG
  return 0.0;
  }
****/

// convert float number , arg f unchanged if no valid number found
unsigned char SafeString::toFloat(float  &f) {
  cleanUp();
  double d;
  if (toDouble(d)) {
    f = (float)d; // need to ckeck size here
    return true;
  } // else
  return false;
}

// convert double number , arg d unchanged if no valid number found
unsigned char SafeString::toDouble(double  &d) {
  cleanUp();
  if (len == 0) {
    return false; // not found
  }
  char* endPtr;
  double result = strtod(buffer, &endPtr); // handles 123 (use 0 for 0xAF and 037 (octal))
  // check endPtr to see if number valid 5a is invalid,  5. is valid
  if (endPtr == buffer)  { // no numbers found at all
    return false;
  } // else
  // else check for trailing white space
  while (*endPtr != '\0') {
    if (!isspace(*endPtr)) { // number terminated by white space
      return false;
    }
    endPtr++;
  }
  d = result;
  return true; // OK
}

/** end of Number Parsing / Conversion  methods *****************/


/*******************************************************/
/**  Tokenizing methods,  stoken(), nextToken()        */
/** Differences between stoken() and nextToken
   stoken() leaves the SafeString unchanged, nextToken() removes the token (and leading delimiters) from the SafeString giving space to add more input
   In stoken() the end of the SafeString is always treated as a delimiter, i.e. the last token is returned even if it is not followed by one of the delimiters
   In nextToken() the end of the SafeString is a delimiter by default, but setting returnLastNonDelimitedToken =  false will leave last token that is not terminated in the SafeString
   Setting returnLastNonDelimitedToken = false this allows partial tokens to be read from a Stream and kept until the full token and delimiter is read
*/
/*******************************************************/
/*
     stoken  -- The SafeString itself is not changed
     stoken breaks into the SafeString into tokens using chars in delimiters string and the end of the SafeString as delimiters.
     Any leading delimiters are first stepped over and then the delimited token is return in the token argument (less the delimiter).
     The token argument is always cleared at the start of the stoken().
     if there are any argument errors or the token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString

     params
     token - the SafeString to return the token in, it is cleared if no delimited token found or if there are errors
             The found delimited token (less the delimiter) is returned in the token SafeString argument if there is capacity.
             The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.
             If the token's capacity is < the next token, then token is returned empty and an error messages printed if debug is enabled.
             In this case the return (nextIndex) is still updated.
     fromIndex -- where to start the search from  0 to length() and -1 is valid for fromIndex,  -1 => length() for processing
     delimiters - the characters that any one of which can delimit a token. The end of the SafeString is always a delimiter.
     returnEmptyFields -- default false, if true only skip one leading delimiter after each call. If the fromIndex is 0 and there is a delimiter at the beginning of the SafeString, an empty token will be returned
     useAsDelimiters - default true, if false then token consists only of chars in the delimiters and any other char terminates the token

     return -- nextIndex, the next index in this SafeString after the end of the token just found, -1 if this is the last token
              Use this as the fromIndex for the next call
              NOTE: if there are no delimiters then -1 is returned and the whole SafeString returned in token if the SafeString token argument is large enough
              If the token's capacity is < the next token, the token returned is empty and an error messages printed if debug is enabled.
              In this case the returned nextIndex is still updated to end of the token just found so that that the program will not be stuck in an infinite loop testing for nextIndex >=0
              while being consistent with the SafeString's all or nothing insertion rule

     Input argument errors return -1 and an empty token and hasError() is set on both this SafeString and the token SafeString.
**/


int SafeString::stoken(SafeString & token, unsigned int fromIndex, const char delimiter, bool returnEmptyFields, bool useAsDelimiters) {
  token.clear(); // no need to clean up token
  if (!delimiter) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("stoken"));
      debugPtr->print(F(" was passed a '\\0' delimiter"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  return stokenInternal(token, fromIndex, NULL, delimiter, returnEmptyFields,  useAsDelimiters);
}

int SafeString::stoken(SafeString &token, unsigned int fromIndex, SafeString &delimiters, bool returnEmptyFields, bool useAsDelimiters) {
  token.clear(); // no need to clean up token
  delimiters.cleanUp();
  return stoken(token, fromIndex, delimiters.buffer, returnEmptyFields, useAsDelimiters); // calls cleanUp()
}

int SafeString::stoken(SafeString &token, unsigned int fromIndex, const char* delimiters, bool returnEmptyFields, bool useAsDelimiters) {
  token.clear(); // no need to clean up token
  if (!delimiters) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("stoken"));
      debugPtr->print(F(" was passed a NULL pointer for delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  if (*delimiters == '\0') {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("stoken"));
      debugPtr->print(F(" was passed a empty list of delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  return stokenInternal(token, fromIndex, delimiters, '\0', returnEmptyFields,  useAsDelimiters);
}

