satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
int SafeString::stokenInternal(SafeString &token, unsigned int fromIndex, const char* delimitersIn, char delimiterIn, bool returnEmptyFields, bool useAsDelimiters) {
  cleanUp();
  token.clear(); // no need to clean up token
  char charDelim[2];
  charDelim[0] = delimiterIn;
  charDelim[1] = '\0';
  const char *delimiters = delimitersIn;
  if (delimiters == NULL) {
    delimiters = charDelim;
  }
  if ((fromIndex == (unsigned int)(-1)) || (fromIndex == len)) {
    return -1; // reached end of input return empty token and -1
    // this is a common case when stepping over delimiters
  }
  // else invalid fromIndex
  if (fromIndex > len) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("stoken"));
      debugPtr->print(F(" fromIndex ")); debugPtr->print(fromIndex); debugPtr->print(F(" > ")); outputName(); debugPtr->print(F(".length() : ")); debugPtr->print(len);
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return -1;
  }
  size_t count = 0;
  // skip leading delimiters  (prior to V2.0.2 leading delimiters not skipped)
  // count will == len-fromIndex if no delimiters found
  if (useAsDelimiters) {
    count = strspn(buffer + fromIndex, delimiters); // count chars ONLY in delimiters
  } else {
    count = strcspn(buffer + fromIndex, delimiters); // count chars NOT in delimiters
  }
  if (returnEmptyFields) {
    // only step over one
    if (count > 0) {
      if (fromIndex == 0) {
        return 1; // leading empty token
      } // else skip over only one of the last delimiters
      count = 1;
    }
  }
  fromIndex += count;
  if (fromIndex == len) {
    return -1; // reached end of input scaning for non-delimiters, return empty token and -1
  }
  // find length of token
  if (useAsDelimiters) {
    count = strcspn(buffer + fromIndex, delimiters); // count chars NOT in delimiters, i.e. the token
  } else {
    count = strspn(buffer + fromIndex, delimiters); // count chars ONLY in delimiters, i.e. the delimiters are the token
  }
  if (count > token._capacity) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("stoken"));
      debugPtr->print(F(" token SafeString ")); token.outputName(); debugPtr->print(F(" needs capacity of "));
      debugPtr->print(count); debugPtr->print(F(" for token '")); debugPtr->write((uint8_t*)(buffer + fromIndex), count); debugPtr->print('\'');
      token.debugInternalResultMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    size_t rtn = fromIndex + count;  // used to be len + 1; prior to V2.0.3
    if (rtn >= len) {
      return -1;
    } else {
      return rtn;
    }
  }
  // else get substring
  substring(token, fromIndex, fromIndex + count);
  size_t rtn = fromIndex + count;  // used to be len + 1; prior to V2.0.3
  if (rtn >= len) {
    return -1;
  } else {
    return rtn;
  }
}
/** end of stoken methods *******************/

/* nextToken -- The token is removed from the SafeString ********************
  nextToken -- Any leading delimiters are first removed, then the delimited token found is removed from the SafeString.
               See returnEmptyFields and returnLastNonDelimitedToken arguments below for controls on this.
               The following delimiters remain in the SafeString so you can test which delimiter terminated the token, provided this SafeString is not empty!
  The token argument is always cleared at the start of the firstToken() and nextToken().
  IMPORTANT!! Changed V4.0.4 By default un-delimited tokens at the end of the SafeString are returned
  To leave partial un-delimited tokens on the end of the SafeString, set returnLastNonDelimitedToken = false.
  Setting returnLastNonDelimitedToken = false allows the SafeString to hold partial tokens when reading from an input stream one char at a time.

  @param token - the SafeString to return the token in, it is always cleared first and will be empty if no delimited token is found or if there are errors<br>
          The token's capacity should be >= this SafeString's capacity incase the entire SafeString needs to be returned.<br>
          If the token's capacity is < the next token, then nextToken() returns true, but the returned token argument is empty and an error messages printed if debug is enabled.
          In this case to next token is still removed from the SafeString so that the program will not be stuck in an infinite loop calling nextToken()
  @param delimiters - the delimiting characters, any one of which can delimit a token
  @param returnEmptyFields -- default false, if true, nextToken() will return true, and an empty token for each consecuative delimiters
  @param returnLastNonDelimitedToken -- default true, will return last part of SafeString even if not delimited. If set false, will keep it for further input to be added to this SafeString
  @param firstToken -- default false, a leading delimiter will be stepped over before looking for a delimited token<br>
  if set to true, a leading delimiter will delimit an empty token which will be returned only if returnEmptyFields is true otherwise it is skipped over.<br>
  NOTE: if returnEmptyFields == false this firstToken argument has no effect.
  NOTE: since the last delimiter is left in the SafeString, you must set firstToken to be false (or omit it) after the first call.

  @return -- true if nextToken() finds a token in this SafeString that is terminated by one of the delimiters, else false<br>
            If the return is true, but hasError() is true then the SafeString token argument did not have the capacity to hold the next token.<br.
            in this case to next token is still removed from the SafeString so that the program will not be stuck in an infinite loop calling nextToken()<br>
            while being consistent with the SafeString's all or nothing insertion rule<br>
           Input argument errors return false and an empty token and hasError() is set on both this SafeString and the token SafeString.
**/

unsigned char SafeString::nextToken(SafeString& token, const char delimiter, bool returnEmptyFields, bool returnLastNonDelimitedToken, bool firstToken) {
  cleanUp();
  token.clear();
  if (!delimiter) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("nextToken"));
      debugPtr->print(F(" was passed a '\\0' delimiter"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return false;
  }
  if (isEmpty()) {
    // empty token returned
    return false;
  }
  if (firstToken && (delimiter == charAt(0)) && returnEmptyFields) {
    // empty token returned
    return  true;
  }
  return nextTokenInternal(token, NULL, delimiter, returnEmptyFields, returnLastNonDelimitedToken);
}

