satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
     @param  strPtr - pointer char array to read from
     @param  maxCharsToRead -- the maximum chars to read into the SafeString, defaults to ((unsigned int)-1) i.e. max unsigned int.

     @return - the number of chars read
*/
unsigned int SafeString::readFrom(const char* strPtr, unsigned int maxCharsToRead) {
  cleanUp();
  if ((!strPtr) || (!(*strPtr))) {
    len = 0;
    buffer[len] = '\0'; // terminate
    return 0;
  }
  // check reading from ourselves
  if (strPtr == buffer) {
    return 0; // nothing new read
  }
  // else
  unsigned int i = 0;
  while ((len < _capacity) && (*strPtr) && (i < maxCharsToRead)) {
    // have space and not end of input
    buffer[len++] = *strPtr++;
    i++;
  }
  buffer[len] = '\0'; // terminate
  return i;
}

/*
   writeTo(SafeString & output, unsigned int startIdx = 0)  writes from SafeString, starting at startIdx to output
   params
     output - the SafeString to write to
     startIdx - where to start writing from calling SafeString, defaults to 0,
                if startIdx >= length(), nothing written and length() returned

   returns new startIdx for next write
   write stops when the end if the calling SafeString is reached or the output is full
   Note: if the sfOutput is already full, then nothing will be written and startIdx will be returned
**/
unsigned int SafeString::writeTo(SafeString & output, unsigned int startIdx) {
  output.cleanUp();
  cleanUp();
  if (startIdx > len) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("writeTo"));
      debugPtr->print(F(" startIdx:"));  debugPtr->print(startIdx);
      debugPtr->print(F(" > length():"));  debugPtr->print(len);
      if (fullDebug) {
        debugPtr->println(); debugPtr->print(F("       "));
        debugPtr->print(F(" Output arg was '")); debugPtr->print(output); debugPtr->print('\'');
      }
      debugInternalMsg(fullDebug);
    }
#endif
    return len; // nothing written
  }
  if (output.len == output._capacity) {
    // not room to write
    return startIdx; // no change
  }
  size_t writeLen = len - startIdx;
  if (writeLen > (output._capacity - output.len)) {
    writeLen = (output._capacity - output.len); // limit to space available
  }
  memmove(output.buffer + output.len, buffer + startIdx, writeLen);
  output.len += writeLen;
  output.buffer[output.len] = '\0';
  size_t newStartIdx = startIdx + writeLen;
  if (newStartIdx >= len) {
    return len;
  } else {
    return newStartIdx;
  }
}

/** end of  ReadFrom from SafeString, writeTo SafeString ************/

/****************************************************************/
/**  NON-Blocking reads from Stream,  read() and readUntil()    */
/****************************************************************/

/* read(Stream& input) --  reads from the Stream (if chars available) into the SafeString
      The is NON-BLOCKING and returns immediately if nothing available to be read
      returns true if something added to string else false
      Note: if the SafeString is already full, then nothing will be read and false will be returned
*/
unsigned char SafeString::read(Stream& input) {
  cleanUp();
  bool rtn = false;
  noCharsRead = 0;
  while (input.available() && (len < _capacity)) {
    int c = input.read();
    noCharsRead++;
    if (c != '\0') { // skip any nulls read
      concat((char)c);
      rtn = true;
    } else {
      setError(); // found '\0' in input
      if (debugPtr) {
        debugPtr->println(); debugPtr->print(F("!! Error:")); outputName();
        debugPtr->println(F(" -- read '\\0' from Stream."));
      }
    }
  }
  return rtn; // true if something added to string
}

/*
  readUntil( ) ---  returns true if delimiter found or string filled, found else false
      NON-blocking readUntil of Stream, if chars are available
      returns true if delimiter found or string filled, found else false
      if a delimiter is found it is included in the return

      params
        input - the Stream object to read from
        delimiters - string of valid delimieters
      return true if SafeString is full or a delimiter is read, else false
      Any delimiter read is returned.  Only at most one delimiter is added per call
     Multiple sucessive delimiters require multiple calls to read them
**/
unsigned char SafeString::readUntil(Stream& input, const char delimiter) {
  if (!delimiter) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntil"));
      debugPtr->print(F(" was passed a '\\0' delimiter"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return len + 1;
  }
  return readUntilInternal(input, NULL, delimiter);
}

unsigned char SafeString::readUntil(Stream& input, SafeString &delimiters) {
  delimiters.cleanUp();
  return readUntil(input, delimiters.buffer); // calls cleanUp()
}

unsigned char SafeString::readUntil(Stream& input, const char* delimiters) {
  if (!delimiters) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntil"));
      debugPtr->print(F(" was passed a NULL pointer for delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return false; // no match
  }
  if (*delimiters == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntil"));
      debugPtr->print(F(" was passed a empty list of delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return false; // no match
  }
  return readUntilInternal(input, delimiters, '\0');
}


bool SafeString::readUntilInternal(Stream& input, const char* delimitersIn, const char delimiterIn) {
  cleanUp();
  char charDelim[2];
  charDelim[0] = delimiterIn;
  charDelim[1] = '\0';
  const char *delimiters = delimitersIn;
  if (delimiters == NULL) {
    delimiters = charDelim;
  }
  noCharsRead = 0;
  while (input.available() && (len < (capacity()))) {
    int c = input.read();
    noCharsRead++;
    if (c == '\0') {
      setError(); // found '\0' in input
#ifdef SSTRING_DEBUG
      if (debugPtr) {
        debugPtr->println(); debugPtr->print(F("!! Error:"));; outputName();
        debugPtr->println(F(" -- read '\\0' from Stream."));
      }
#endif // SSTRING_DEBUG
      continue; // skip nulls
    }
    concat((char)c); // add char may be delimiter
    if (strchr(delimiters, c) != NULL) {
      return true; // found delimiter return true
    }
  }
  if (isFull()) {
    return true;
  } // else
  return false;
}


