satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
/*
      NON-blocking readUntilToken
      returns true if a delimited token is found, else false
      ONLY delimited tokens of length less than this SafeString's capacity will return true with a non-empty token.
      Streams of chars that overflow this SafeString's capacity are ignored and return an empty token on the next delimiter or timeout
      That is this SafeString's capacity should be at least 1 more then the largest expected token.
      If this SafeString OR the SafeString & token return argument is too small to hold the result, the token is returned empty and an error message output if debugging is enabled.
      The delimiter is NOT included in the SafeString & token return.  It will the first char of the this SafeString when readUntilToken returns true
      It is recommended that the capacity of the SafeString & token argument be >= this SafeString's capacity
      Each call to this method removes any leading delimiters so if you need to check the delimiter do it BEFORE the next call to readUntilToken()
      if token does not have the capacity to hold the substring, hasError() is set on both this SafeString and the token SafeString
      If this SafeString is empty and received just a delimiter, then return an empty token and leave delimiter in the SafeString
        On the next call may get just another delimiter in that case will skip over both, return empty token and add back last delimiter received
        Result is that multiple consecutive delimiters will return multiple empty tokens.
      Reading of the input stream stops at the first delimiter read, so any following data is still in the stream's RX buffer

      params
        input - the Stream object to read from
        token - the SafeString to return the token found if any, always cleared at the start of this method
        delimiters - string of valid delimieters
        skipToDelimiter - a bool variable to hold the skipToDelimiter state between calls
        echoInput - defaults to true to echo the chars read
        timeout_ms - defaults to never timeout, pass a non-zero ms to autoterminate the last token if no new chars received for that time.

      returns true if a delimited series of chars found that fit in this SafeString else false
      If this SafeString OR the SafeString & token argument is too small to hold the result, the returned token is returned empty
      The delimiter is NOT included in the SafeString & token return. It will the first char of the this SafeString when readUntilToken returns true
 **/

unsigned char SafeString::readUntilToken(Stream & input, SafeString& token, const char delimiter, bool & skipToDelimiter, uint8_t echoInput, unsigned long timeout_ms) {
  if (!delimiter) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntilToken"));
      debugPtr->print(F(" was passed a '\\0' delimiter"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return len + 1;
  }
  return readUntilTokenInternal(input, token, NULL, delimiter, skipToDelimiter, echoInput, timeout_ms);
}

unsigned char SafeString::readUntilToken(Stream & input, SafeString& token, SafeString& delimiters, bool & skipToDelimiter, uint8_t echoInput, unsigned long timeout_ms) {
  delimiters.cleanUp();
  return readUntilToken(input, token, delimiters.buffer, skipToDelimiter, echoInput, timeout_ms); // calls cleanUp()
}

unsigned char SafeString::readUntilToken(Stream & input, SafeString& token, const char* delimiters, bool & skipToDelimiter, uint8_t echoInput, unsigned long timeout_ms) {
  if (!delimiters) {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntilToken"));
      debugPtr->print(F(" was passed a NULL pointer for delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return false; // no match
  }
  if (*delimiters == '\0') {
    setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntilToken"));
      debugPtr->print(F(" was passed a empty list of delimiters"));
      debugInternalMsg(fullDebug);
    }
#endif // SSTRING_DEBUG
    return false; // no match
  }
  return readUntilTokenInternal(input, token, delimiters, '\0', skipToDelimiter, echoInput, timeout_ms);
}

bool SafeString::readUntilTokenInternal(Stream & input, SafeString& token, const char* delimitersIn, const char delimiterIn, bool & skipToDelimiter, uint8_t echoInput, unsigned long timeout_ms) {
  token.clear(); // always
  if ((echoInput != 0) && (echoInput != 1) && (timeout_ms == 0)) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntilToken"));
      debugPtr->println(F(" was passed timeout for the echo setting, method format is:-"));
      debugPtr->println(F("   readTokenUntil(stream,token,delimiters,skipToDelimiter,echoOn,timeout_ms)"));
    }
#endif // SSTRING_DEBUG
    timeout_ms = echoInput; // swap to timeout
    echoInput = false; // use default
  }

  if (capacity() < 2) {
    setError();
    token.setError();
#ifdef SSTRING_DEBUG
    if (debugPtr) {
      errorMethod(F("readUntilToken"));
      debugPtr->println(F(" SafeString needs capacity of at least 2, one char + one delimiter"));
    }
#endif // SSTRING_DEBUG
    return false;
  }

  cleanUp();
  char charDelim[2];
  charDelim[0] = delimiterIn;
  charDelim[1] = '\0';
  const char *delimiters = delimitersIn;
  if (delimiters == NULL) {
    delimiters = charDelim;
  }
  // remove leading delimiters
  size_t delim_count = 0;
  // skip leading delimiters  (prior to V2.0.2 leading delimiters not skipped)
  delim_count = strspn(buffer, delimiters); // count char ONLY in delimiters
  remove(0, delim_count); // remove leading delimiters

  // NOTE: this method's contract says you can set skipToDelimiter true at any time
  // so here stop reading on first delimiter and process results
  // loop here until either isFill() OR no more chars avail OR found delimiter
  // read at most capacity() each time if skipping
  // this prevent infinite loop if using SafeStringStream with echoOn and rx buffer overflow has dropped all the delimiters
  //size_t charRead = 0;
  noCharsRead = 0;
  if ((timeout_ms > 0) && (!timeoutRunning) && skipToDelimiter) {
    timeoutRunning = true;
    timeoutStart_ms = millis(); // start timer
  }
  char haveReadDelimiter = '\0';
  while (input.available() && (len < capacity()) && (noCharsRead < capacity()) ) {
    int c = input.read();
    noCharsRead++;
      //  if (debugPtr) {
      //    debugPtr->print(F("read:")); debugPtr->println((char)c);
      //  }
    if (c == '\0') {
      setError(); // found '\0' in input
      token.setError();
      if (debugPtr) {
        debugPtr->println(); debugPtr->print(F("!! Error:")); outputName();
        debugPtr->println(F(" -- read '\\0' from Stream."));
      }
      continue; // skip nulls  // don't update timer on null chars
    }
    if (echoInput) {
      input.print((char) c);
    }
    if (timeout_ms > 0) {
      // got new char reset timeout
      timeoutRunning = true;
      timeoutStart_ms = millis(); // start timer
    }
    if (!skipToDelimiter) {
      concat((char)c); // add char may be delimiter
    }
    if (strchr(delimiters, c) != NULL) {
      if (skipToDelimiter) {
        // if skipToDelimiter then started with empty SafeString
        skipToDelimiter = false; // found next delimiter not added above because skipToDelimiter
        clear();
        concat((char)c); // is a delimiter
        return false; // empty token
      } else {
        // added c above
        // if (!haveReadDelimiter) {
        haveReadDelimiter = c;
        //}
        break; // process this token
      }
    }
  }
  // here either isFill() OR no more chars avail OR found delimiter
  // skipToDelimiter may still be true here if no delimiter found above
  // skip multiple delimiters and do not return last non-delimited token
  if (nextToken(token, delimiters, false, false)) { // removes leading delimiters if any
    // returns true only if have found delimited token, returns false if full and no delimiter
    // IF found delimited token, delimiter was add just now and so timer was reset
    // skipToDelimiter is false here since found delimiter
    return true; // not full and not timeout and have new token
  } else if (haveReadDelimiter) {
    //  this SafeString was empty and just got only a delimiter, so nextToken removed it and returns false
    // so add back the single delimiter just received and return an empty token
    concat(haveReadDelimiter); // is a delimiter
    return true; // empty token,
  }


  // else
  if (isFull()) { // note if full here then > max token as capacity needs to allow for one delimiter
    // SafeString is full of chars but no delimiter
    // discard the chars and skip input until get next delimiter
    setError();
    token.setError();
    if (debugPtr) {
      debugPtr->println(); debugPtr->print(F("!! Error:")); outputName();
      debugPtr->print(F(" -- input length exceeds capacity "));
      debugInternalMsg(fullDebug);
    }
    clear();  // not full now
    skipToDelimiter = true;
    return false; // will do timeout check next call.  No token found return false
  }

  // else no token found AND not full AND last char NOT a delimiter
  if (timeoutRunning) { // here not full because called nextToken OR checked for full
    if ((millis() - timeoutStart_ms) > timeout_ms) {
      // no new chars for timeout add terminator
      timeoutRunning = false;
      // put in delimiter
      if ((len != 0) || skipToDelimiter) { // have something to delimit or had somthing, else just stop timer
        //          if (debugPtr) { // input timeout is normal if timeout set
        //            debugPtr->println(); debugPtr->print("!! "); outputName();
        //            debugPtr->println(F(" -- Input timed out."));
        //          }
        if (skipToDelimiter) {
          clear();  // not full now
          skipToDelimiter = false;
          return false;
        } // else pick up token
        // len > 0 so token only empty if too small
        //concat(delimiters[0]);   // certainly NOT full from above
        // skip multiple delimiters, and return last one (default
        nextToken(token, delimiters, false, true); // collect this token just delimited, this will clear input
        // remove delimiter just added
        //remove(0, 1);
        return true;
      }
    }
  }
  return false; // no token
}

size_t SafeString::getLastReadCount() {
  return noCharsRead;
}

