satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
/** end of NON-Blocking reads from Stream,  read() and readUntil() *******************/

/*******************************************************/
/** Private methods for Debug and Error support           */
/*******************************************************/
void SafeString::debugInternal(bool verbose) const {
  if (debugPtr) {
    if (name) {
      debugPtr->print(' ');
      debugPtr->print(name);
    } // else no name set
    debugPtr->print(F(" cap:")); debugPtr->print(_capacity);
    debugPtr->print(F(" len:")); debugPtr->print(len);
    if (verbose) { // print SafeString current contents
      debugPtr->print(F(" '")); debugPtr->print(buffer); debugPtr->print('\'');
    }
    debugPtr->println();
  }
}

// this internal msg debug does not add line indent if not fullDebug
// always need to add debugPtr->println() at end of debug output
void SafeString::debugInternalMsg(bool verbose) const {
  (void)(verbose);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    if (verbose) {
      debugPtr->println(); // terminate first line
      debugPtr->print(F("       "));
    } else {
      debugPtr->print(F(" --- ")); // not full debug
    }
    if (name) {
      debugPtr->print(' ');
      debugPtr->print(name);
    } // else no name set
    debugPtr->print(F(" cap:")); debugPtr->print(_capacity);
    debugPtr->print(F(" len:")); debugPtr->print(len);
    if (verbose) { // print SafeString current contents
      debugPtr->print(F(" '")); debugPtr->print(buffer); debugPtr->print('\'');
    }
    debugPtr->println();
  }
#endif // SSTRING_DEBUG
}

void SafeString::debugInternalResultMsg(bool verbose) const {
  (void)(verbose);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    if (verbose) {
      debugPtr->println(); // terminate first line
      debugPtr->print(F("       "));
    } else {
      debugPtr->print(F(" --- ")); // not full debug
    }
    if (name) {
      debugPtr->print(' ');
      debugPtr->print(name);
    } // else no name set
    debugPtr->print(F(" cap:")); debugPtr->print(_capacity);
    debugPtr->print(F(" len:")); debugPtr->print(len);
    if (verbose) { // print SafeString current contents
      debugPtr->print(F(" '")); debugPtr->print(buffer); debugPtr->print('\'');
    }
    debugPtr->println();
  }
#endif // SSTRING_DEBUG
}

void SafeString::outputName() const {
  if (debugPtr) {
    debugPtr->print(' ');
    if (name) {
      debugPtr->print(name);
    } else {
      debugPtr->print(F("SafeString"));
    }
  }
}


void SafeString::capError(const __FlashStringHelper * methodName, size_t neededCap, const char* cstr, const __FlashStringHelper * pstr, char c, size_t length) const {
  (void)(methodName); (void)(neededCap);   (void)(cstr);   (void)(pstr);   (void)(c);   (void)(length);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    errorMethod(methodName); // checks for NULL
    debugPtr->print(F(" needs capacity of "));
    debugPtr->print(neededCap);
    if (fromBuffer) {
      debugPtr->print(F("(i.e. char[")); debugPtr->print(neededCap + 1);  debugPtr->print(F("])"));
    }
    if (length != 0) {
      debugPtr->print(F(" for the first ")); debugPtr->print(length); debugPtr->print(F(" chars of the input."));
    }
    if (!fullDebug) {
      debugInternalMsg(fullDebug);
    } else {
      debugPtr->println();
      debugPtr->print(F("       ")); // indent next line
      if (cstr || pstr || (c != '\0')) {
        debugPtr->print(F(" Input arg was "));
        if (cstr) {
          debugPtr->print('\'');
          debugPtr->print(cstr);
          debugPtr->print('\'');
        } else if (pstr) {
          debugPtr->print(F("F(\""));
          debugPtr->print(pstr);
          debugPtr->print("\")");
        } else if (c != '\0') {
          debugPtr->print('\'');
          debugPtr->print(c);
          debugPtr->print('\'');
        }
      }
      debugInternalMsg(fullDebug);
    }
  }
#endif
}

void SafeString::assignError(size_t neededCap, const char* cstr, const __FlashStringHelper * pstr, char c, bool numberFlag) const {
  (void)(neededCap);   (void)(cstr);   (void)(pstr);   (void)(c);   (void)(numberFlag);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    debugPtr->print(F("Error:"));
    outputName();
    debugPtr->print(F(" = "));
    if (cstr || pstr || (c != '\0')) {
      if (cstr) {
        if (!numberFlag) {
          debugPtr->print('\"');
        }
        debugPtr->print(cstr);
        if (!numberFlag) {
          debugPtr->print('\"');
        }
      } else if (pstr) {
        debugPtr->print(F("F(\""));
        debugPtr->print(pstr);
        debugPtr->print("\")");
      } else if (c != '\0') {
        debugPtr->print('\'');
        debugPtr->print(c);
        debugPtr->print('\'');
      }
    }
    debugPtr->println();
    debugPtr->print(F(" needs capacity of "));
    debugPtr->print(neededCap);
    debugInternalMsg(fullDebug);
  }
#endif
}

void SafeString::baseError(const __FlashStringHelper * methodName, int base) const {
  (void)(methodName);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    debugPtr->print(F("Error:"));
    outputName();
    debugPtr->print('.');
    if (methodName) {
      debugPtr->print(methodName);
    }
    debugPtr->print(F("()"));
    debugPtr->print(F(" base arg was:"));
    debugPtr->print(base);
    debugPtr->println(F("  Must be in range 2 to 16"));
  }
#endif
}
    

void SafeString::errorMethod(const __FlashStringHelper * methodName) const {
  (void)(methodName);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    debugPtr->print(F("Error:"));
    outputName();
    debugPtr->print('.');
    if (methodName) {
      debugPtr->print(methodName);
    }
    debugPtr->print(F("()"));
  }
#endif
}

void SafeString::warningMethod(const __FlashStringHelper * methodName) const {
  (void)(methodName);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    debugPtr->print(F("Warning:"));
    outputName();
    debugPtr->print('.');
    if (methodName) {
      debugPtr->print(methodName);
    }
    debugPtr->print(F("()"));
  }
#endif
}

void SafeString::outputFromIndexIfFullDebug(unsigned int fromIndex) const {
  (void)(fromIndex);
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    if (fullDebug) {
      debugPtr->println(); debugPtr->print(F("       "));
      debugPtr->print(F(" fromIndex is ")); debugPtr->print(fromIndex);
    }
  }
#endif
}

void SafeString::concatErr() const {
#ifdef SSTRING_DEBUG
  errorMethod(F("concat"));
#endif
}

void SafeString::assignErrorMethod() const {
#ifdef SSTRING_DEBUG
  if (debugPtr) {
    debugPtr->print(F("Error:"));
    outputName();
    debugPtr->print(F(" = "));
  }
#endif
}

void SafeString::concatAssignError() const {
#ifdef SSTRING_DEBUG
  assignErrorMethod();
#endif
}

void SafeString::printlnErr() const {
#ifdef SSTRING_DEBUG
  errorMethod(F("println"));
#endif
}

