satspares/ldmos_design_with_dwin_display/ATmega4808-2026/ATmega4808/lib/SafeStringIO/src/SafeString.cpp
void SafeString::prefixErr() const {
#ifdef SSTRING_DEBUG
  errorMethod(F("prefix"));
#endif
}
/*****************  end of private internal debug support methods *************************/

/**
  // dtostrf for those boards that don't have it
  static char *dtostrf (double val, signed char width, unsigned char prec, char *sout) {
  asm(".global _printf_float");

  char fmt[20];
  sprintf(fmt, "%%%d.%df", width, prec);
  sprintf(sout, fmt, val);
  return sout;
  }
**/

/*-
   toInt64_t modified from strtoll

   Copyright (c) 2014 The Regents of the University of California.
   All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, are permitted provided that the following conditions
   are met:
   1. Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
   2. Redistributions in binary form must reproduce the above copyright
      notice, this list of conditions and the following disclaimer in the
      documentation and/or other materials provided with the distribution.
   3. [rescinded 22 July 1999]
   4. Neither the name of the University nor the names of its contributors
      may be used to endorse or promote products derived from this software
      without specific prior written permission.

   THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
   ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
   IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
   ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
   FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
   DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
   OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
   HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
   LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
   OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
   SUCH DAMAGE.
*/


/*

  @deftypefn Supplemental {long long int} strtoll (const char *@var{string}, @
  char **@var{endptr}, int @var{base})
  @deftypefnx Supplemental {unsigned long long int} strtoul (@
  const char *@var{string}, char **@var{endptr}, int @var{base})

  The @code{strtoll} function converts the string in @var{string} to a
  long long integer value according to the given @var{base}, which must be
  between 2 and 36 inclusive, or be the special value 0.  If @var{base}
  is 0, @code{strtoll} will look for the prefixes @code{0} and @code{0x}
  to indicate bases 8 and 16, respectively, else default to base 10.
  When the base is 16 (either explicitly or implicitly), a prefix of
  @code{0x} is allowed.  The handling of @var{endptr} is as that of
  @code{strtod} above.  The @code{strtoull} function is the same, except
  that the converted value is unsigned.

  @end deftypefn

*/


/* FIXME: It'd be nice to configure around these, but the include files are too
   painful.  These macros should at least be more portable than hardwired hex
   constants. */

#define SF_UINT64_MAX (~(uint64_t)0) /* 0xFFFFFFFFFFFFFFFF */
#define SF_INT64_MAX ((int64_t)(SF_UINT64_MAX >> 1)) /* 0x7FFFFFFFFFFFFFFF */
#define SF_INT64_MIN (~SF_INT64_MAX) /* 0x8000000000000000 */

/*
   Convert a string to an int64_t integer.

   Ignores `locale' stuff.  Assumes that the upper and lower case
   alphabets and digits are each contiguous.
*/
int64_t SafeString::strto_int64_t(const char *nptr, char **endptr, int base) {
  const char *s = nptr;
  uint64_t acc;
  int c;
  uint64_t cutoff;
  int neg = 0, any, cutlim;

  /*
     Skip white space and pick up leading +/- sign if any.
     If base is 0, allow 0x for hex and 0 for octal, else
     assume decimal; if base is already 16, allow 0x.
  */
  do {
    c = *s++;
  } while (isspace(c));
  if (c == '-') {
    neg = 1;
    c = *s++;
  } else if (c == '+')
    c = *s++;
  if ((base == 0 || base == 16) &&
      c == '0' && (*s == 'x' || *s == 'X')) {
    c = s[1];
    s += 2;
    base = 16;
  }
  if (base == 0)
    base = c == '0' ? 8 : 10;

  /*
     Compute the cutoff value between legal numbers and illegal
     numbers.  That is the largest legal value, divided by the
     base.  An input number that is greater than this value, if
     followed by a legal input character, is too big.  One that
     is equal to this value may be valid or not; the limit
     between valid and invalid numbers is then based on the last
     digit.  For instance, if the range for longs is
     [-2147483648..2147483647] and the input base is 10,
     cutoff will be set to 214748364 and cutlim to either
     7 (neg==0) or 8 (neg==1), meaning that if we have accumulated
     a value > 214748364, or equal but the next digit is > 7 (or 8),
     the number is too big, and we will return a range error.

     Set any if any `digits' consumed; make it negative to indicate
     overflow.
  */
  cutoff = neg ? -(uint64_t)SF_INT64_MIN : SF_INT64_MAX;
  cutlim = cutoff % (uint64_t)base;
  cutoff /= (uint64_t)base;
  for (acc = 0, any = 0;; c = *s++) {
    if (isdigit(c))
      c -= '0';
    else if (isalpha(c))
      c -= isupper(c) ? 'A' - 10 : 'a' - 10;
    else
      break;
    if (c >= base)
      break;
    if (any < 0 || acc > cutoff || (acc == cutoff && c > cutlim))
      any = -1;
    else {
      any = 1;
      acc *= base;
      acc += c;
    }
  }
  if (any < 0) {
    acc = neg ? SF_INT64_MIN : SF_INT64_MAX;
  } else if (neg)
    acc = -acc;
  if (endptr != 0)
    *endptr = (char *) (any ? s - 1 : nptr);
  return (acc);
}


/**
      convert the SafeString to a int64_t (for time_t long long).
      @param l -- int64_t reference, where the result is stored. l is only updated if the conversion is successful
      @return -- 0 if the SafeString is not a valid int, else return non-zero<br>
        leading and trailing white space is allowed around a valid int
*/
unsigned char SafeString::toInt64_t(int64_t &l) {
  cleanUp();
  if (len == 0) {
    return false; // not found
  }
  char* endPtr;
  int64_t result = strto_int64_t(buffer, &endPtr, 10); // handles 123 (use 0 for 0xAF and 037 (octal))
  if (result == SF_INT64_MAX) {
    return false;
  }
  if (result == SF_INT64_MIN) {
    return false;
  }
  // check endPtr to see if number valid 5a is invalid,  5. is valid
  if (endPtr == buffer)  { // no numbers found at all
    return false;
  } // else
  // else check for trailing white space
  while (*endPtr != '\0') {
    if (!isspace(*endPtr)) { // number terminated by white space
      return false;
    }
    endPtr++;
  }
  // else all OK
  l = result;
  return true; // OK
}

